package com.elevenst.terroir.product.registration.category.code;

import com.elevenst.common.util.GroupCodeInterface;

/**
 *  공통코드
 *  인증정보 필수 카테고리(PD247)
 *  별도의 DB조회의 지양 &코드값을 확인하기 위한 jump code를 막아 가독성 증대를 위해, 한글로 enum 설정해 봄.
 *  (인코딩 이슈 등의 오류가 나면 즉시 롤백하여 영어로 변경하거나 하겠습니다.)
 */
public enum PD247_CertInfoRequireCtgr implements GroupCodeInterface {


        PD247_1001344(                    "1001344", "기저귀")
//        ,

//        PD247_1001344_기저귀(                    "1001344", "기저귀"),
//        PD247_1001349_수유용품(                  "1001349", "수유용품"),
//        PD247_1001352_유아안전_실내용품(         "1001352", "유아안전/실내용품"),
//        PD247_1001353_외출용품(                  "1001353", "외출용품"),
//        PD247_1001355_신생아_의류(               "1001355", "신생아 의류"),
//        PD247_1001356_유아의류(                  "1001356", "유아의류"),
//        PD247_1001357_아동_주니어_의류(          "1001357", "아동/주니어 의류"),
//        PD247_1001358_유아동신발(                "1001358", "유아동신발"),
//        PD247_1001359_유아동잡화(                "1001359", "유아동잡화"),
//        PD247_1001360_유아가구_침구(             "1001360", "유아가구/침구"),
//        PD247_1001362_장난감(                    "1001362", "장난감"),
//        PD247_1001368_유아동가구(                "1001368", "유아동가구"),
//        PD247_1001376_조명(                      "1001376", "조명"),
//        PD247_1001398_스키_보드(                 "1001398", "스키/보드"),
//        PD247_1001399_인라인_스케이트보드(       "1001399", "인라인/스케이트보드"),
//        PD247_1001409_저주파_적외선용품(         "1001409", "저주파/적외선용품"),
//        PD247_1001421_자동차기기(                "1001421", "자동차기기"),
//        PD247_1001424_안전_보안용품(             "1001424", "안전/보안용품"),
//        PD247_1001425_스마트기기(                "1001425", "스마트기기"),
//        PD247_1001430_TV(                        "1001430", "TV"),
//        PD247_1001431_냉장고(                    "1001431", "냉장고"),
//        PD247_1001432_세탁기(                    "1001432", "세탁기"),
//        PD247_1001433_생활가전(                  "1001433", "생활가전"),
//        PD247_1001434_주방가전(                  "1001434", "주방가전"),
//        PD247_1001435_영상가전(                  "1001435", "영상가전"),
//        PD247_1001436_음향가전(                  "1001436", "음향가전"),
//        PD247_1001437_이미용가전(                "1001437", "이미용가전"),
//        PD247_1001438_계절가전(                  "1001438", "계절가전"),
//        PD247_1001439_노트북(                    "1001439", "노트북"),
//        PD247_1001440_데스크탑(                  "1001440", "데스크탑"),
//        PD247_1001441_모니터(                    "1001441", "모니터"),
//        PD247_1001442_프린터_복합기(             "1001442", "프린터/복합기"),
//        PD247_1001443_저장장치(                  "1001443", "저장장치"),
//        PD247_1001444_PC부품(                    "1001444", "PC부품"),
//        PD247_1001445_컴퓨터_주변기기(           "1001445", "컴퓨터 주변기기"),
//        PD247_1001551_유아목욕용품(              "1001551", "유아목욕용품"),
//        PD247_1002159_아동_스포츠의류(           "1002159", "아동 스포츠의류"),
//        PD247_1002167_아동_스포츠잡화(           "1002167", "아동 스포츠잡화"),
//        PD247_1002246_스탠드(                    "1002246", "스탠드"),
//        PD247_1002250_크리스마스_트리(           "1002250", "크리스마스 트리"),
//        PD247_1002271_아동침구(                  "1002271", "아동침구"),
//        PD247_1002469_아동등산복(                "1002469", "아동등산복"),
//        PD247_1002519_전동_스쿠터(               "1002519", "전동 스쿠터"),
//        PD247_1002520_보행차_실버카 (            "1002520", "보행차/실버카 "),
//        PD247_1002528_보행보조용품(              "1002528", "보행보조용품"),
//        PD247_1002536_대형_안마의자(             "1002536", "대형 안마의자"),
//        PD247_1002543_핫팩(                      "1002543", "핫팩"),
//        PD247_1002544_손난로(                    "1002544", "손난로"),
//        PD247_1002545_찜질기(                    "1002545", "찜질기"),
//        PD247_1002547_반신욕기(                  "1002547", "반신욕기"),
//        PD247_1002548_전신사우나(                "1002548", "전신사우나"),
//        PD247_1002549_좌욕기(                    "1002549", "좌욕기"),
//        PD247_1002550_좌훈기(                    "1002550", "좌훈기"),
//        PD247_1002627_전동공구(                  "1002627", "전동공구"),
//        PD247_1002628_절삭공구(                  "1002628", "절삭공구"),
//        PD247_1002629_측정용공구(                "1002629", "측정용공구"),
//        PD247_1002630_용접공구(                  "1002630", "용접공구"),
//        PD247_1002631_유_공압공구(               "1002631", "유/공압공구"),
//        PD247_1002632_작업_수공구(               "1002632", "작업/수공구"),
//        PD247_1002633_공작_관수(                 "1002633", "공작/관수"),
//        PD247_1002634_배관공구(                  "1002634", "배관공구"),
//        PD247_1002635_소형기계(                  "1002635", "소형기계"),
//        PD247_1002636_예초기(                    "1002636", "예초기"),
//        PD247_1002638_농업기계_농업용품(         "1002638", "농업기계/농업용품"),
//        PD247_1002654_타이어(                    "1002654", "타이어"),
//        PD247_1002656_램프(                      "1002656", "램프"),
//        PD247_1002664_전기용품(                  "1002664", "전기용품"),
//        PD247_1002666_편의용품(                  "1002666", "편의용품"),
//        PD247_1002669_전기_산업용품(             "1002669", "전기/산업용품"),
//        PD247_1002670_페인트_용품(               "1002670", "페인트/용품"),
//        PD247_1002673_계절용품(                  "1002673", "계절용품"),
//        PD247_1002675_게임기(                    "1002675", "게임기"),
//        PD247_1002691_DSLR카메라(                "1002691", "DSLR카메라"),
//        PD247_1002692_미러리스카메라(            "1002692", "미러리스카메라"),
//        PD247_1002693_일반_디지털카메라(         "1002693", "일반 디지털카메라"),
//        PD247_1002696_액션캠(                    "1002696", "액션캠"),
//        PD247_1002700_배터리_충전기(             "1002700", "배터리/충전기"),
//        PD247_1002705_조명_라이트(               "1002705", "조명/라이트"),
//        PD247_1002709_리퍼_중고(                 "1002709", "리퍼/중고"),
//        PD247_1002710_캠코더(                    "1002710", "캠코더"),
//        PD247_1002712_안드로이드(                "1002712", "안드로이드"),
//        PD247_1002713_iOS(                       "1002713", "iOS"),
//        PD247_1002714_Windows(                   "1002714", "Windows"),
//        PD247_1002715_듀얼OS(                    "1002715", "듀얼OS"),
//        PD247_1002717_기타(                      "1002717", "기타"),
//        PD247_1002718_KT(                        "1002718", "KT"),
//        PD247_1002719_LG_U(                      "1002719", "LG U+"),
//        PD247_1002720_SKT(                       "1002720", "SKT"),
//        PD247_1002721_공기계(                    "1002721", "공기계"),
//        PD247_1002722_배터리(                    "1002722", "배터리"),
//        PD247_1002723_알뜰폰(                    "1002723", "알뜰폰"),
//        PD247_1002724_중고폰(                    "1002724", "중고폰"),
//        PD247_1002725_인터넷_결합상품(           "1002725", "인터넷 결합상품"),
//        PD247_1002726_휴대폰_충전기(             "1002726", "휴대폰 충전기"),
//        PD247_1002731_휴대폰_케이블(             "1002731", "휴대폰 케이블"),
//        PD247_1002733_핸즈프리(                  "1002733", "핸즈프리"),
//        PD247_1002734_포켓와이파이(              "1002734", "포켓와이파이"),
//        PD247_1002815_자전거(                    "1002815", "자전거"),
//        PD247_1002822_전기_전동_레저(            "1002822", "전기/전동 레저"),
//        PD247_1003020_학용품_학습준비물(         "1003020", "학용품/학습준비물")
        ;

        private String dtlsCd;
        private String dtlsComNm;
        PD247_CertInfoRequireCtgr(String dtlsCd, String dtlsComNm) {
            this.dtlsCd = dtlsCd;
            this.dtlsComNm = dtlsComNm;
        }

        public String getDtlsCd() {
            return dtlsCd;
        }

        public String getDtlsComNm() {
            return dtlsComNm;
        }

        public String getGrpCd() {
            return "PD247";
        }

        public String getGrpCdNm() {
            return "인증정보 필수 카테고리";
        }

}
